## Plan Result (web-client-cdk-production)

[CI link](https://github.com/Pocket/web-client/actions/runs/20316539366)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/WebClient-Prod:972" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/WebClient-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                      - {
                          - name      = "BRAZE_PRIVATE_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/WebClient/Prod/BRAZE_PRIVATE_KEY"
                        },
                        {
                            name      = "REVALIDATION_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/WebClient/Prod/REVALIDATION_TOKEN"
                        },
                        # (1 unchanged element hidden)
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "WebClient-Prod" -> (known after apply)
      ~ revision                 = 972 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-webclient"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "WebClient"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/WebClient-Prod:972" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":1459,"Program":"tfcmt","SHA1":"37754e4e691dc6e728bcc5dc8ac42d3324d874be","Target":"web-client-cdk-production","Vars":{},"WorkflowName":"Build Clients"} -->